fsedano/esp32-aes-gw/sdkconfig.defaults
# ESP32-S3 ARINC429 linecard — shared defaults (application build).

CONFIG_IDF_TARGET="esp32s3"

# Waveshare ESP32-S3-ETH: 8 MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Custom partition table: factory = recovery app, ota_0 = main app.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# W5500 over SPI.
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# A freshly OTA'd app must mark itself valid (done once the control server
# is up) or the bootloader rolls back — a crash-looping image auto-reverts
# to the factory recovery app without user action.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 1 ms tick for the protocol timing services.
CONFIG_FREERTOS_HZ=1000

# The USB-C port is a TinyUSB HID joystick in the application build, which
# claims the ESP32-S3's single internal USB PHY: the USB-Serial-JTAG
# secondary console on that port would die at tinyusb_driver_install()
# anyway, so drop it cleanly (logs stay on UART0). The recovery build
# overrides this back and never installs TinyUSB.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# esp_tinyusb: one HID interface, no CDC/MSC.
CONFIG_TINYUSB_HID_COUNT=1
